AccumulationRegisters/ВзаиморасчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаУчетаНачислений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыУчетаНачисленийИУдержаний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/НачисленияУдержанияПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>НачисленияУдержанияПоСотрудникам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеПлановогоНачисления</v8:Type>
						<v8:Type>cfg:DocumentRef.ПризПодарок</v8:Type>
						<v8:Type>cfg:DocumentRef.УдержаниеВСчетРасчетовПоПрочимОперациям</v8:Type>
						<v8:Type>cfg:DocumentRef.УдержаниеПрофсоюзныхВзносов</v8:Type>
						<v8:Type>cfg:DocumentRef.Совмещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорАвторскогоЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.Премия</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнительныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорЗаймаСотруднику</v8:Type>
						<v8:Type>cfg:DocumentRef.РазовоеНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПриемкиВыполненныхРаботОказанныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоходВНатуральнойФорме</v8:Type>
						<v8:Type>cfg:DocumentRef.ДоговорРаботыУслуги</v8:Type>
						<v8:Type>cfg:DocumentRef.Командировка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПостоянноеУдержаниеВПользуТретьихЛиц</v8:Type>
						<v8:Type>cfg:DocumentRef.МатериальнаяПомощь</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереносДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеМежрасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриторияВыполненияРаботВОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторииВыполненияРаботВОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Comment>Для строк НДФЛ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьВРаспределенииНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолученияДохода</Name>
					<Comment>Для строк НДФЛ</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПолученияДохода</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторииВыполненияРаботВОрганизации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаУчетаНачислений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыУчетаНачисленийИУдержаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачислениеУдержание</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаиморасчетовССотрудниками</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОсобыхНачисленийИУдержаний</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОтработанноеВремяПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ОтработанноеВремяПоСотрудникам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтработаноДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплаченоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаНачисленияУдержанияВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыНачисленияУдержанияВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеНачисления</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Начисление</Name>
					<Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ГруппыНачисленияУдержанияВыплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ГруппыНачисленияУдержанияВыплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдоПоБухучету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальноеСальдоПоМесяцамРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начислено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удержано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплаченоПоБухучету</Name>
					<Comment> Возвращает выплаты в течение календарного месяца</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплаченоПоМесяцамРасчета</Name>
					<Comment>Возвращает выплаты за расчетные месяцы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдоПоБухучету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдоПоМесяцамРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонечноеСальдоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Льготы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЗарплатаКадрыОбщиеНаборыДанныхБазовый/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстОбщегоЗапроса(ИсточникДанных) Экспорт
	
	ТекстЗапроса = "";
	
	Если ВРег(ИсточникДанных) = ВРег("НачисленияУдержания") Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Период
		|ПОМЕСТИТЬ Представления_Периоды
		|ГДЕ
		|	""НачалоИнтервала"" = &НачалоПериода
		|	И ""ОкончаниеИнтервала"" = &КонецПериода
		|	И ""Периодичность"" = ""МЕСЯЦ""
		|	И ""ИспользоватьКонецПериода"" = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
		|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
		|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
		|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
		|	КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК Период
		|ПОМЕСТИТЬ ВТВсеСотрудникиСПериодом
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&КонецПериода)}, Месяц, , {(Сотрудник), (ФизическоеЛицо), (Организация)}) КАК ВзаиморасчетыССотрудниками
		|{ГДЕ
		|	ВзаиморасчетыССотрудниками.Организация.*,
		|	ВзаиморасчетыССотрудниками.Сотрудник.*,
		|	ВзаиморасчетыССотрудниками.ФизическоеЛицо.*,
		|	ВзаиморасчетыССотрудниками.СтатьяФинансирования.*,
		|	ВзаиморасчетыССотрудниками.СтатьяРасходов.*,
		|	ВзаиморасчетыССотрудниками.Подразделение.*}
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияИУдержания.Организация,
		|	НачисленияИУдержания.Сотрудник,
		|	НачисленияИУдержания.ФизическоеЛицо,
		|	НачисленияИУдержания.СтатьяФинансирования,
		|	НачисленияИУдержания.СтатьяРасходов,
		|	НачисленияИУдержания.Подразделение,
		|	КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ)
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
		|ГДЕ
		|	НачисленияИУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|{ГДЕ
		|	НачисленияИУдержания.Организация.*,
		|	НачисленияИУдержания.Сотрудник.*,
		|	НачисленияИУдержания.ФизическоеЛицо.*,
		|	НачисленияИУдержания.СтатьяФинансирования.*,
		|	НачисленияИУдержания.СтатьяРасходов.*,
		|	НачисленияИУдержания.Подразделение.*,
		|	НачисленияИУдержания.НачислениеУдержание.* КАК ВидРасчета}
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияИУдержания.Организация,
		|	НачисленияИУдержания.Сотрудник,
		|	НачисленияИУдержания.ФизическоеЛицо,
		|	НачисленияИУдержания.СтатьяФинансирования,
		|	НачисленияИУдержания.СтатьяРасходов,
		|	НачисленияИУдержания.Подразделение,
		|	НачисленияИУдержания.ДатаНачала
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
		|ГДЕ
		|	НачисленияИУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НачисленияИУдержания.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
		|{ГДЕ
		|	НачисленияИУдержания.Организация.*,
		|	НачисленияИУдержания.Сотрудник.*,
		|	НачисленияИУдержания.ФизическоеЛицо.*,
		|	НачисленияИУдержания.СтатьяФинансирования.*,
		|	НачисленияИУдержания.СтатьяРасходов.*,
		|	НачисленияИУдержания.Подразделение.*,
		|	НачисленияИУдержания.НачислениеУдержание.* КАК ВидРасчета}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОстаткиИОбороты.Организация КАК Организация,
		|	ОстаткиИОбороты.Сотрудник КАК Сотрудник,
		|	ОстаткиИОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОстаткиИОбороты.Подразделение КАК Подразделение,
		|	ОстаткиИОбороты.СтатьяФинансирования,
		|	ОстаткиИОбороты.СтатьяРасходов,
		|	ОстаткиИОбороты.Период КАК Период
		|ПОМЕСТИТЬ ВТВсеПериодомКадровыхДанных
		|ИЗ
		|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОстаткиИОбороты.Организация,
		|	ОстаткиИОбороты.Сотрудник,
		|	ОстаткиИОбороты.ФизическоеЛицо,
		|	ОстаткиИОбороты.Подразделение,
		|	ОстаткиИОбороты.СтатьяФинансирования,
		|	ОстаткиИОбороты.СтатьяРасходов,
		|	Месяцы.Период
		|ИЗ
		|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
		|		ПО (ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОстаткиИОбороты.Организация,
		|	ОстаткиИОбороты.Сотрудник,
		|	ОстаткиИОбороты.ФизическоеЛицо,
		|	ОстаткиИОбороты.Подразделение,
		|	ОстаткиИОбороты.СтатьяФинансирования,
		|	ОстаткиИОбороты.СтатьяРасходов,
		|	КОНЕЦПЕРИОДА(Месяцы.Период, МЕСЯЦ)
		|ИЗ
		|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОстаткиИОбороты.Организация КАК Организация,
		|	ОстаткиИОбороты.Сотрудник КАК Сотрудник,
		|	ОстаткиИОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ОстаткиИОбороты.Подразделение КАК Подразделение,
		|	ОстаткиИОбороты.СтатьяФинансирования,
		|	ОстаткиИОбороты.СтатьяРасходов,
		|	Месяцы.Период КАК Месяц
		|ПОМЕСТИТЬ ВТСотрудникиМесяцы
		|ИЗ
		|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
		|		ПО (ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
		|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка) КАК ВидЗанятости, 
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ПустаяСсылка) КАК ВидДоговора,
		|	0 КАК ТарифнаяСтавка,
		|	0 КАК ТекущаяТарифнаяСтавка,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаУвольнения
		|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудников
		|ИЗ
		|	ВТВсеПериодомКадровыхДанных КАК Сотрудники
		|ГДЕ
		|	""ТолькоРазрешенные"" = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
		|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
		|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
		|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
		|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетовНачальныйОстаток КАК НачальныйОстаток,
		|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетовКонечныйОстаток КАК КонечныйОстаток,
		|	ВзаиморасчетыССотрудниками.Период
		|ПОМЕСТИТЬ ВТОстаткиИОбороты
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&КонецПериода)}, Месяц, , {(Сотрудник), (ФизическоеЛицо), (Организация)}) КАК ВзаиморасчетыССотрудниками
		|{ГДЕ
		|	ВзаиморасчетыССотрудниками.Организация.*,
		|	ВзаиморасчетыССотрудниками.Сотрудник.*,
		|	ВзаиморасчетыССотрудниками.ФизическоеЛицо.*,
		|	ВзаиморасчетыССотрудниками.СтатьяФинансирования.*,
		|	ВзаиморасчетыССотрудниками.СтатьяРасходов.*,
		|	ВзаиморасчетыССотрудниками.Подразделение.*}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СотрудникиМесяцы.Организация КАК Организация,
		|	СотрудникиМесяцы.Сотрудник КАК Сотрудник,
		|	СотрудникиМесяцы.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиМесяцы.СтатьяФинансирования,
		|	СотрудникиМесяцы.СтатьяРасходов,
		|	СотрудникиМесяцы.Подразделение КАК Подразделение,
		|	СотрудникиМесяцы.Месяц,
		|	МАКСИМУМ(ОстаткиИОбороты.Период) КАК ПоследнийМесяцОстатков
		|ПОМЕСТИТЬ ВТСотрудникиМесяцыОстатков
		|ИЗ
		|	ВТСотрудникиМесяцы КАК СотрудникиМесяцы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиИОбороты КАК ОстаткиИОбороты
		|		ПО СотрудникиМесяцы.Организация = ОстаткиИОбороты.Организация
		|			И СотрудникиМесяцы.Сотрудник = ОстаткиИОбороты.Сотрудник
		|			И СотрудникиМесяцы.ФизическоеЛицо = ОстаткиИОбороты.ФизическоеЛицо
		|			И СотрудникиМесяцы.Подразделение = ОстаткиИОбороты.Подразделение
		|			И СотрудникиМесяцы.СтатьяФинансирования = ОстаткиИОбороты.СтатьяФинансирования
		|			И СотрудникиМесяцы.СтатьяРасходов = ОстаткиИОбороты.СтатьяРасходов
		|			И СотрудникиМесяцы.Месяц >= ОстаткиИОбороты.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	СотрудникиМесяцы.Организация,
		|	СотрудникиМесяцы.Сотрудник,
		|	СотрудникиМесяцы.ФизическоеЛицо,
		|	СотрудникиМесяцы.СтатьяФинансирования,
		|	СотрудникиМесяцы.СтатьяРасходов,
		|	СотрудникиМесяцы.Подразделение,
		|	СотрудникиМесяцы.Месяц
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СотрудникиМесяцыОстатков.Организация КАК Организация,
		|	СотрудникиМесяцыОстатков.Сотрудник КАК Сотрудник,
		|	СотрудникиМесяцыОстатков.ФизическоеЛицо КАК ФизическоеЛицо,
		|	СотрудникиМесяцыОстатков.СтатьяФинансирования КАК СтатьяФинансирования,
		|	СотрудникиМесяцыОстатков.СтатьяРасходов КАК СтатьяРасходов,
		|	СотрудникиМесяцыОстатков.Подразделение КАК Подразделение,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА СотрудникиМесяцыОстатков.Месяц = ОстаткиИОбороты.Период
		|				ТОГДА ОстаткиИОбороты.НачальныйОстаток
		|			ИНАЧЕ ОстаткиИОбороты.КонечныйОстаток
		|		КОНЕЦ, 0) КАК НачальныйОстаток,
		|	ЕСТЬNULL(ОстаткиИОбороты.КонечныйОстаток, 0) КАК КонечныйОстаток,
		|	КОНЕЦПЕРИОДА(СотрудникиМесяцыОстатков.Месяц, МЕСЯЦ) КАК Период
		|ПОМЕСТИТЬ ВТСальдоВсеСотрудникиПериоды
		|ИЗ
		|	ВТСотрудникиМесяцыОстатков КАК СотрудникиМесяцыОстатков
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиИОбороты КАК ОстаткиИОбороты
		|		ПО СотрудникиМесяцыОстатков.Организация = ОстаткиИОбороты.Организация
		|			И СотрудникиМесяцыОстатков.Сотрудник = ОстаткиИОбороты.Сотрудник
		|			И СотрудникиМесяцыОстатков.ФизическоеЛицо = ОстаткиИОбороты.ФизическоеЛицо
		|			И СотрудникиМесяцыОстатков.Подразделение = ОстаткиИОбороты.Подразделение
		|			И СотрудникиМесяцыОстатков.СтатьяФинансирования = ОстаткиИОбороты.СтатьяФинансирования
		|			И СотрудникиМесяцыОстатков.СтатьяРасходов = ОстаткиИОбороты.СтатьяРасходов
		|			И СотрудникиМесяцыОстатков.ПоследнийМесяцОстатков = ОстаткиИОбороты.Период
		|ГДЕ
		|	(НЕ ОстаткиИОбороты.НачальныйОстаток ЕСТЬ NULL 
		|			ИЛИ НЕ ОстаткиИОбороты.КонечныйОстаток ЕСТЬ NULL )
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(ВзаиморасчетыССотрудниками.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудник,
		|	КадровыеДанныеСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	КадровыеДанныеСотрудников.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
		|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода, 
		|	КадровыеДанныеСотрудников.ВидДоговора КАК ВидДоговораГоловногоСотрудникаНаКонецПериода,
		|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
		|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
		|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
		|	ВзаиморасчетыССотрудниками.НачальныйОстаток КАК НачальныйОстаток,
		|	ВзаиморасчетыССотрудниками.КонечныйОстаток КАК КонечныйОстаток,
		|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК Период,
		|	КадровыеДанныеСотрудников.Подразделение КАК ПодразделениеНаКонецПериода,
		|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятостиНаКонецПериода,
		|	КадровыеДанныеСотрудников.ВидДоговора КАК ВидДоговораНаКонецПериода,
		|	КадровыеДанныеСотрудников.Должность,
		|	КадровыеДанныеСотрудников.Должность КАК ДолжностьНаКонецПериода,
		|	ВЫБОР
		|		КОГДА КадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				И КадровыеДанныеСотрудников.ДатаУвольнения <= КадровыеДанныеСотрудников.Период
		|			ТОГДА КадровыеДанныеСотрудников.ТекущаяТарифнаяСтавка
		|		ИНАЧЕ КадровыеДанныеСотрудников.ТарифнаяСтавка
		|	КОНЕЦ КАК ТарифнаяСтавка,
		|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	КадровыеДанныеСотрудников.ВидДоговора КАК ВидДоговора
		|ПОМЕСТИТЬ ВТСальдоПоРасчетамССотрудниками
		|ИЗ
		|	ВТСальдоВсеСотрудникиПериоды КАК ВзаиморасчетыССотрудниками
		|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО ВзаиморасчетыССотрудниками.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = КадровыеДанныеСотрудников.Период)}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) КАК МесяцНачисления,
		|	НачисленияИУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
		|	НачисленияИУдержания.СтатьяФинансирования КАК СтатьяФинансирования,
		|	НачисленияИУдержания.СтатьяРасходов КАК СтатьяРасходов,
		|	НачисленияИУдержания.Подразделение КАК Подразделение,
		|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты КАК Группа,
		|	НачисленияИУдержания.НачислениеУдержание КАК ВидРасчета,
		|	СУММА(НачисленияИУдержания.Сумма) КАК Сумма,
		|	НачисленияИУдержания.Организация КАК Организация,
		|	НачисленияИУдержания.Сотрудник,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = НачисленияИУдержания.ПериодДействия
		|			ТОГДА НачисленияИУдержания.ДатаНачала
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(НачисленияИУдержания.ДатаНачала, МЕСЯЦ)
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = НачисленияИУдержания.ПериодДействия
		|			ТОГДА НачисленияИУдержания.ДатаОкончания
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(НачисленияИУдержания.ДатаОкончания, МЕСЯЦ), ДЕНЬ)
		|	КОНЕЦ КАК ДатаОкончания,
		|	ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудник,
		|	КадровыеДанныеГоловныхСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	КадровыеДанныеГоловныхСотрудников.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
		|	КадровыеДанныеГоловныхСотрудников.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода, 
		|	КадровыеДанныеГоловныхСотрудников.ВидДоговора КАК ВидДоговораГоловногоСотрудникаНаКонецПериода,
		|	НачисленияИУдержания.ПериодДействия,
		|	НачисленияИУдержания.Регистратор,
		|	КадровыеДанныеСотрудниковНаКонецПериод.Подразделение КАК ПодразделениеНаКонецПериода,
		|	КадровыеДанныеСотрудниковНаКонецПериод.ВидЗанятости КАК ВидЗанятостиНаКонецПериода, 
		|	КадровыеДанныеСотрудниковНаКонецПериод.ВидДоговора КАК ВидДоговораНаКонецПериода,
		|	КадровыеДанныеСотрудниковНаКонецПериод.Должность КАК ДолжностьНаКонецПериода,
		|	КадровыеДанныеСотрудников.Должность,
		|	ВЫБОР
		|		КОГДА КадровыеДанныеСотрудниковНаКонецПериод.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				И КадровыеДанныеСотрудниковНаКонецПериод.ДатаУвольнения <= КадровыеДанныеСотрудниковНаКонецПериод.Период
		|			ТОГДА КадровыеДанныеСотрудниковНаКонецПериод.ТекущаяТарифнаяСтавка
		|		ИНАЧЕ КадровыеДанныеСотрудниковНаКонецПериод.ТарифнаяСтавка
		|	КОНЕЦ КАК ТарифнаяСтавкаНаКонецПериода,
		|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
		|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,    
		|	КадровыеДанныеСотрудников.ВидДоговора КАК ВидДоговора,
		|	NULL КАК Показатель,
		|	NULL КАК Значение
		|ПОМЕСТИТЬ ВТНачисленияИУдержанияСКадровымиДанными
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
		|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудниковНаКонецПериод
		|		ПО НачисленияИУдержания.Сотрудник = КадровыеДанныеСотрудниковНаКонецПериод.Сотрудник
		|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = КадровыеДанныеСотрудниковНаКонецПериод.Период)}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО НачисленияИУдержания.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И (ВЫБОР
		|				КОГДА НачисленияИУдержания.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
		|					ТОГДА КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ)
		|				ИНАЧЕ НачисленияИУдержания.ДатаНачала
		|			КОНЕЦ = КадровыеДанныеСотрудников.Период)}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеГоловныхСотрудников
		|		ПО (ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник = КадровыеДанныеГоловныхСотрудников.Сотрудник)
		|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = КадровыеДанныеГоловныхСотрудников.Период)}
		|ГДЕ
		|	НачисленияИУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|{ГДЕ
		|	НачисленияИУдержания.Сотрудник.*,
		|	НачисленияИУдержания.ФизическоеЛицо.*,
		|	НачисленияИУдержания.Организация.*,
		|	НачисленияИУдержания.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияИУдержания.ФизическоеЛицо,
		|	НачисленияИУдержания.СтатьяФинансирования,
		|	НачисленияИУдержания.СтатьяРасходов,
		|	НачисленияИУдержания.Подразделение,
		|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты,
		|	НачисленияИУдержания.НачислениеУдержание,
		|	НачисленияИУдержания.Организация,
		|	НачисленияИУдержания.Сотрудник,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = НачисленияИУдержания.ПериодДействия
		|			ТОГДА НачисленияИУдержания.ДатаНачала
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(НачисленияИУдержания.ДатаНачала, МЕСЯЦ)
		|	КОНЕЦ,
		|	ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник,
		|	КадровыеДанныеГоловныхСотрудников.Должность,
		|	КадровыеДанныеГоловныхСотрудников.Подразделение,
		|	КадровыеДанныеГоловныхСотрудников.ВидЗанятости,
		|	КадровыеДанныеГоловныхСотрудников.ВидДоговора,
		|	НачисленияИУдержания.ПериодДействия,
		|	НачисленияИУдержания.Регистратор,
		|	КадровыеДанныеСотрудниковНаКонецПериод.Подразделение,
		|	КадровыеДанныеСотрудниковНаКонецПериод.ВидЗанятости,
		|	КадровыеДанныеСотрудниковНаКонецПериод.ВидДоговора,
		|	КадровыеДанныеСотрудниковНаКонецПериод.Должность,
		|	КадровыеДанныеСотрудников.Должность,
		|	КадровыеДанныеСотрудников.ТарифнаяСтавка,
		|	КадровыеДанныеСотрудников.ВидЗанятости,
		|	КадровыеДанныеСотрудников.ВидДоговора,
		|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ),
		|	ВЫБОР
		|		КОГДА КадровыеДанныеСотрудниковНаКонецПериод.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				И КадровыеДанныеСотрудниковНаКонецПериод.ДатаУвольнения <= КадровыеДанныеСотрудниковНаКонецПериод.Период
		|			ТОГДА КадровыеДанныеСотрудниковНаКонецПериод.ТекущаяТарифнаяСтавка
		|		ИНАЧЕ КадровыеДанныеСотрудниковНаКонецПериод.ТарифнаяСтавка
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = НачисленияИУдержания.ПериодДействия
		|			ТОГДА НачисленияИУдержания.ДатаОкончания
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(НачисленияИУдержания.ДатаОкончания, МЕСЯЦ), ДЕНЬ)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ) КАК МесяцНачисления,
		|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Подразделение КАК Подразделение,
		|	ОтработанноеВремя.Начисление КАК ВидРасчета,
		|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ) = ОтработанноеВремя.ПериодДействия
		|			ТОГДА ОтработанноеВремя.ДатаНачала
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ОтработанноеВремя.ДатаНачала, МЕСЯЦ)
		|	КОНЕЦ КАК ДатаНачала,
		|	СУММА(ОтработанноеВремя.ОтработаноДней) КАК ОтработаноДней,
		|	СУММА(ОтработанноеВремя.ОтработаноЧасов) КАК ОтработаноЧасов,
		|	СУММА(ОтработанноеВремя.ОплаченоДней) КАК ОплаченоДней,
		|	СУММА(ОтработанноеВремя.ОплаченоЧасов) КАК ОплаченоЧасов
		|ПОМЕСТИТЬ ВТОтработанноеВремяВПериодах
		|ИЗ
		|	РегистрНакопления.ОтработанноеВремяПоСотрудникам КАК ОтработанноеВремя
		|ГДЕ
		|	ОтработанноеВремя.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|{ГДЕ
		|	ОтработанноеВремя.Сотрудник.*,
		|	ОтработанноеВремя.ФизическоеЛицо.*,
		|	ОтработанноеВремя.Организация.*,
		|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Подразделение,
		|	ОтработанноеВремя.Начисление,
		|	ОтработанноеВремя.ВремяВЧасах,
		|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ),
		|	ОтработанноеВремя.ПериодДействия,
		|	ВЫБОР
		|		КОГДА НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ) = ОтработанноеВремя.ПериодДействия
		|			ТОГДА ОтработанноеВремя.ДатаНачала
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ОтработанноеВремя.ДатаНачала, МЕСЯЦ)
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
		|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Подразделение КАК Подразделение,
		|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
		|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
		|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
		|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
		|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
		|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
		|	ОтработанноеВремя.ДатаНачала,
		|	НачисленияИУдержания.СтатьяФинансирования,
		|	НачисленияИУдержания.СтатьяРасходов
		|ПОМЕСТИТЬ ВТОтработанноеВремяСНачислениями
		|ИЗ
		|	ВТОтработанноеВремяВПериодах КАК ОтработанноеВремя
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
		|		ПО (ОтработанноеВремя.МесяцНачисления = НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ))
		|			И ОтработанноеВремя.Регистратор = НачисленияИУдержания.Регистратор
		|			И ОтработанноеВремя.Сотрудник = НачисленияИУдержания.Сотрудник
		|			И ОтработанноеВремя.Подразделение = НачисленияИУдержания.Подразделение
		|			И ОтработанноеВремя.ВидРасчета = НачисленияИУдержания.НачислениеУдержание
		|			И ОтработанноеВремя.ПериодДействия = НачисленияИУдержания.ПериодДействия
		|			И (ОтработанноеВремя.ДатаНачала = ВЫБОР
		|				КОГДА НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = НачисленияИУдержания.ПериодДействия
		|					ТОГДА НачисленияИУдержания.ДатаНачала
		|				ИНАЧЕ НАЧАЛОПЕРИОДА(НачисленияИУдержания.ДатаНачала, МЕСЯЦ)
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
		|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Подразделение КАК Подразделение,
		|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
		|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
		|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
		|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
		|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
		|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
		|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
		|	МИНИМУМ(ОтработанноеВремя.СтатьяФинансирования) КАК СтатьяФинансирования
		|ПОМЕСТИТЬ ВТОтработанноеВремяСоСтатьейФинансирования
		|ИЗ
		|	ВТОтработанноеВремяСНачислениями КАК ОтработанноеВремя
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтработанноеВремя.МесяцНачисления,
		|	ОтработанноеВремя.ПериодДействия,
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Подразделение,
		|	ОтработанноеВремя.ВидРасчета,
		|	ОтработанноеВремя.ОтработаноДней,
		|	ОтработанноеВремя.ОтработаноЧасов,
		|	ОтработанноеВремя.ОплаченоДней,
		|	ОтработанноеВремя.ОплаченоЧасов,
		|	ОтработанноеВремя.ДатаНачала,
		|	ОтработанноеВремя.ВремяВЧасах
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
		|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Подразделение КАК Подразделение,
		|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
		|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
		|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
		|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
		|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
		|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
		|	ОтработанноеВремя.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
		|	МИНИМУМ(ОтработанноеВремя.СтатьяРасходов) КАК СтатьяРасходов
		|ПОМЕСТИТЬ ВТОтработанноеВремя
		|ИЗ
		|	ВТОтработанноеВремяСНачислениями КАК ОтработанноеВремя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтработанноеВремяСоСтатьейФинансирования КАК ОтработанноеВремяСоСтатьейФинансирования
		|		ПО ОтработанноеВремя.МесяцНачисления = ОтработанноеВремяСоСтатьейФинансирования.МесяцНачисления
		|			И ОтработанноеВремя.ПериодДействия = ОтработанноеВремяСоСтатьейФинансирования.ПериодДействия
		|			И ОтработанноеВремя.Регистратор = ОтработанноеВремяСоСтатьейФинансирования.Регистратор
		|			И ОтработанноеВремя.Сотрудник = ОтработанноеВремяСоСтатьейФинансирования.Сотрудник
		|			И ОтработанноеВремя.Подразделение = ОтработанноеВремяСоСтатьейФинансирования.Подразделение
		|			И ОтработанноеВремя.ВидРасчета = ОтработанноеВремяСоСтатьейФинансирования.ВидРасчета
		|			И ОтработанноеВремя.ДатаНачала = ОтработанноеВремяСоСтатьейФинансирования.ДатаНачала   
		|			И ОтработанноеВремя.ВремяВЧасах = ОтработанноеВремяСоСтатьейФинансирования.ВремяВЧасах
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтработанноеВремя.МесяцНачисления,
		|	ОтработанноеВремя.ПериодДействия,
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Подразделение,
		|	ОтработанноеВремя.ВидРасчета,
		|	ОтработанноеВремя.ОтработаноДней,
		|	ОтработанноеВремя.ОтработаноЧасов,
		|	ОтработанноеВремя.ОплаченоДней,
		|	ОтработанноеВремя.ОплаченоЧасов,
		|	ОтработанноеВремя.ДатаНачала,
		|	ОтработанноеВремя.СтатьяФинансирования,
		|	ОтработанноеВремя.ВремяВЧасах
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МИНИМУМ(СальдоПоРасчетамССотрудниками.Период) КАК ПервыйМесяц,
		|	МАКСИМУМ(СальдоПоРасчетамССотрудниками.Период) КАК ПоследнийМесяц,
		|	СальдоПоРасчетамССотрудниками.Организация,
		|	СальдоПоРасчетамССотрудниками.Сотрудник,
		|	СальдоПоРасчетамССотрудниками.ФизическоеЛицо,
		|	СальдоПоРасчетамССотрудниками.Подразделение,
		|	СальдоПоРасчетамССотрудниками.СтатьяФинансирования,
		|	СальдоПоРасчетамССотрудниками.СтатьяРасходов
		|ПОМЕСТИТЬ ВТПоследниеПервыеМесяцы
		|ИЗ
		|	ВТСальдоПоРасчетамССотрудниками КАК СальдоПоРасчетамССотрудниками
		|
		|СГРУППИРОВАТЬ ПО
		|	СальдоПоРасчетамССотрудниками.Организация,
		|	СальдоПоРасчетамССотрудниками.Сотрудник,
		|	СальдоПоРасчетамССотрудниками.ФизическоеЛицо,
		|	СальдоПоРасчетамССотрудниками.Подразделение,
		|	СальдоПоРасчетамССотрудниками.СтатьяФинансирования,
		|	СальдоПоРасчетамССотрудниками.СтатьяРасходов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНачисления,
		|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
		|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
		|	ВзаиморасчетыССотрудниками.ГруппаНачисленияУдержанияВыплаты КАК Группа,
		|	ВзаиморасчетыССотрудниками.ВидВзаиморасчетов КАК ВидРасчета,
		|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов КАК Сумма,
		|	ВЫБОР
		|		КОГДА НЕ ВзаиморасчетыССотрудниками.Подразделение.Владелец ЕСТЬ NULL 
		|			ТОГДА ВзаиморасчетыССотрудниками.Подразделение.Владелец
		|		КОГДА КадровыеДанныеСотрудников.Организация <> ЗНАЧЕНИЕ(СПРАВОЧНИК.Организации.ПустаяСсылка)
		|			ТОГДА КадровыеДанныеСотрудников.Организация
		|		ИНАЧЕ ВзаиморасчетыССотрудниками.Организация
		|	КОНЕЦ КАК Организация,
		|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
		|	ВЫРАЗИТЬ(ВзаиморасчетыССотрудниками.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудник,
		|	КадровыеДанныеГоловныхСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	КадровыеДанныеГоловныхСотрудников.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
		|	КадровыеДанныеГоловныхСотрудников.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,  
		|	КадровыеДанныеГоловныхСотрудников.ВидДоговора КАК ВидДоговораГоловногоСотрудникаНаКонецПериода,
		|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК ПериодДействия,
		|	ВзаиморасчетыССотрудниками.Регистратор КАК Регистратор,
		|	КадровыеДанныеСотрудников.Подразделение КАК ПодразделениеНаКонецПериода,
		|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятостиНаКонецПериода, 
		|	КадровыеДанныеСотрудников.ВидДоговора КАК ВидДоговораНаКонецПериода,
		|	КадровыеДанныеСотрудников.Должность КАК ДолжностьНаКонецПериода,
		|	ВЫБОР
		|		КОГДА КадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
		|				И КадровыеДанныеСотрудников.ДатаУвольнения <= КадровыеДанныеСотрудников.Период
		|			ТОГДА КадровыеДанныеСотрудников.ТекущаяТарифнаяСтавка
		|		ИНАЧЕ КадровыеДанныеСотрудников.ТарифнаяСтавка
		|	КОНЕЦ КАК ТарифнаяСтавкаНаКонецПериода,
		|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
		|	КадровыеДанныеСотрудников.ВидДоговора КАК ВидДоговора,
		|	КадровыеДанныеСотрудников.Должность,
		|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка
		|ПОМЕСТИТЬ ВТДвиженияВзаиморасчетов
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
		|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
		|		ПО ВзаиморасчетыССотрудниками.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
		|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = КадровыеДанныеСотрудников.Период)}
		|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудников КАК КадровыеДанныеГоловныхСотрудников
		|		ПО (ВЫРАЗИТЬ(ВзаиморасчетыССотрудниками.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник = КадровыеДанныеГоловныхСотрудников.Сотрудник)
		|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = КадровыеДанныеГоловныхСотрудников.Период)}
		|ГДЕ
		|	ВзаиморасчетыССотрудниками.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И ВзаиморасчетыССотрудниками.ВидВзаиморасчетов <> ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ПустаяСсылка)
		|{ГДЕ
		|	ВзаиморасчетыССотрудниками.Сотрудник.*,
		|	ВзаиморасчетыССотрудниками.ФизическоеЛицо.*,
		|	ВзаиморасчетыССотрудниками.Организация.*,
		|	ВзаиморасчетыССотрудниками.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСотрудников.МесяцНачисления КАК МесяцНачисления,
		|	ДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
		|	ДанныеСотрудников.СтатьяФинансирования КАК СтатьяФинансирования,
		|	ДанныеСотрудников.СтатьяРасходов КАК СтатьяРасходов,
		|	ДанныеСотрудников.Подразделение КАК Подразделение,
		|	ДанныеСотрудников.Группа КАК Группа,
		|	ДанныеСотрудников.ВидРасчета КАК ВидРасчета,
		|	ДанныеСотрудников.Сумма КАК Сумма,
		|	ДанныеСотрудников.ДатаНачала,
		|	ДанныеСотрудников.ДатаОкончания,
		|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноДней, 0) КАК ОтработаноДней,
		|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноЧасов, 0) КАК ОтработаноЧасов,
		|	ЕСТЬNULL(ОтработанноеВремя.ОплаченоДней, 0) КАК ОплаченоДней,
		|	ЕСТЬNULL(ОтработанноеВремя.ОплаченоЧасов, 0) КАК ОплаченоЧасов,
		|	ДанныеСотрудников.Организация КАК Организация,
		|	ДанныеСотрудников.Сотрудник,
		|	ДанныеСотрудников.ГоловнойСотрудник КАК ГоловнойСотрудник,
		|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидДоговораГоловногоСотрудникаНаКонецПериода КАК ВидДоговораГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ПериодДействия,
		|	ДанныеСотрудников.Регистратор,
		|	ДанныеСотрудников.ПодразделениеНаКонецПериода КАК ПодразделениеНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода КАК ВидЗанятостиНаКонецПериода,
		|	ДанныеСотрудников.ВидДоговораНаКонецПериода КАК ВидДоговораНаКонецПериода,
		|	ДанныеСотрудников.ДолжностьНаКонецПериода,
		|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,   
		|	ДанныеСотрудников.ВидДоговора КАК ВидДоговора,
		|	ДанныеСотрудников.Должность,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	ОтработанноеВремя.ВремяВЧасах,
		|	ДанныеСотрудников.Показатель,
		|	ДанныеСотрудников.Значение,
		|   ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДанныеСотрудников.ВидРасчета) = ТИП(Перечисление.ВидыОсобыхНачисленийИУдержаний) ТОГДА
		|   	1
		|       КОГДА ТИПЗНАЧЕНИЯ(ДанныеСотрудников.ВидРасчета) = ТИП(ПланВидовРасчета.Начисления) ТОГДА
		|       2
		|       Иначе 3
		|   КОНЕЦ КАК ТипНачисленияДляОтчетовП6П7
		|ПОМЕСТИТЬ ОбщиеЗапросы_НачисленияУдержания
		|ИЗ
		|	ВТНачисленияИУдержанияСКадровымиДанными КАК ДанныеСотрудников
		|		{ЛЕВОЕ СОЕДИНЕНИЕ ВТОтработанноеВремя КАК ОтработанноеВремя
		|		ПО ДанныеСотрудников.Регистратор = ОтработанноеВремя.Регистратор
		|			И ДанныеСотрудников.Сотрудник = ОтработанноеВремя.Сотрудник
		|			И ДанныеСотрудников.Подразделение = ОтработанноеВремя.Подразделение
		|			И ДанныеСотрудников.ВидРасчета = ОтработанноеВремя.ВидРасчета
		|			И ДанныеСотрудников.МесяцНачисления = ОтработанноеВремя.МесяцНачисления
		|			И ДанныеСотрудников.ПериодДействия = ОтработанноеВремя.ПериодДействия
		|			И ДанныеСотрудников.ДатаНачала = ОтработанноеВремя.ДатаНачала
		|			И ДанныеСотрудников.СтатьяФинансирования = ОтработанноеВремя.СтатьяФинансирования
		|			И ДанныеСотрудников.СтатьяРасходов = ОтработанноеВремя.СтатьяРасходов}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСотрудников.МесяцНачисления,
		|	ДанныеСотрудников.ФизическоеЛицо,
		|	ДанныеСотрудников.СтатьяФинансирования,
		|	ДанныеСотрудников.СтатьяРасходов,
		|	ДанныеСотрудников.Подразделение,
		|	ДанныеСотрудников.Группа,
		|	ДанныеСотрудников.ВидРасчета,
		|	ДанныеСотрудников.Сумма,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.Организация,
		|	ДанныеСотрудников.Сотрудник,
		|	ДанныеСотрудников.ГоловнойСотрудник,
		|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидДоговораГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ПериодДействия,
		|	ДанныеСотрудников.Регистратор,
		|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,   
		|	ДанныеСотрудников.ВидДоговораНаКонецПериода,
		|	ДанныеСотрудников.ДолжностьНаКонецПериода,
		|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятости,
		|	ДанныеСотрудников.ВидДоговора,
		|	ДанныеСотрудников.Должность,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	NULL,
		|	NULL,
		|	NULL,
		|   ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДанныеСотрудников.ВидРасчета) = ТИП(Перечисление.ВидыОсобыхНачисленийИУдержаний) ТОГДА
		|   	1
		|       КОГДА ТИПЗНАЧЕНИЯ(ДанныеСотрудников.ВидРасчета) = ТИП(ПланВидовРасчета.Начисления) ТОГДА
		|       2
		|       Иначе 3
		|   КОНЕЦ
		|ИЗ
		|	ВТДвиженияВзаиморасчетов КАК ДанныеСотрудников
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСотрудников.Период,
		|	ДанныеСотрудников.ФизическоеЛицо,
		|	ДанныеСотрудников.СтатьяФинансирования,
		|	ДанныеСотрудников.СтатьяРасходов,
		|	ДанныеСотрудников.Подразделение,
		|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.КонечноеСальдо),
		|	NULL,
		|	ДанныеСотрудников.КонечныйОстаток,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.Организация,
		|	ДанныеСотрудников.Сотрудник,
		|	ДанныеСотрудников.ГоловнойСотрудник,
		|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидДоговораГоловногоСотрудникаНаКонецПериода,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,
		|	ДанныеСотрудников.ВидДоговораНаКонецПериода,
		|	ДанныеСотрудников.ДолжностьНаКонецПериода,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	ДанныеСотрудников.ВидЗанятости,
		|	ДанныеСотрудников.ВидДоговора,
		|	ДанныеСотрудников.Должность,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	NULL,
		|	NULL,
		|	NULL,
		|   3
		|ИЗ
		|	ВТСальдоПоРасчетамССотрудниками КАК ДанныеСотрудников
		|ГДЕ
		|	ДанныеСотрудников.Организация ЕСТЬ НЕ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСотрудников.Период,
		|	ДанныеСотрудников.ФизическоеЛицо,
		|	ДанныеСотрудников.СтатьяФинансирования,
		|	ДанныеСотрудников.СтатьяРасходов,
		|	ДанныеСотрудников.Подразделение,
		|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.КонечноеСальдоПериода),
		|	NULL,
		|	ДанныеСотрудников.КонечныйОстаток,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.Организация,
		|	ДанныеСотрудников.Сотрудник,
		|	ДанныеСотрудников.ГоловнойСотрудник,
		|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидДоговораГоловногоСотрудникаНаКонецПериода,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,     
		|	ДанныеСотрудников.ВидДоговораНаКонецПериода,
		|	ДанныеСотрудников.ДолжностьНаКонецПериода,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	ДанныеСотрудников.ВидЗанятости,
		|	ДанныеСотрудников.ВидДоговора,
		|	ДанныеСотрудников.Должность,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	NULL,
		|	NULL,
		|	NULL,
		|   3
		|ИЗ
		|	ВТСальдоПоРасчетамССотрудниками КАК ДанныеСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследниеПервыеМесяцы КАК ПоследниеПервыеМесяцы
		|		ПО (ПоследниеПервыеМесяцы.Организация = ДанныеСотрудников.Организация)
		|			И (ПоследниеПервыеМесяцы.Сотрудник = ДанныеСотрудников.Сотрудник)
		|			И (ПоследниеПервыеМесяцы.ФизическоеЛицо = ДанныеСотрудников.ФизическоеЛицо)
		|			И (ПоследниеПервыеМесяцы.Подразделение = ДанныеСотрудников.Подразделение)
		|			И (ПоследниеПервыеМесяцы.СтатьяФинансирования = ДанныеСотрудников.СтатьяФинансирования)
		|			И (ПоследниеПервыеМесяцы.СтатьяРасходов = ДанныеСотрудников.СтатьяРасходов)
		|			И (ПоследниеПервыеМесяцы.ПоследнийМесяц = ДанныеСотрудников.Период)
		|ГДЕ
		|	ДанныеСотрудников.Организация ЕСТЬ НЕ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСотрудников.Период,
		|	ДанныеСотрудников.ФизическоеЛицо,
		|	ДанныеСотрудников.СтатьяФинансирования,
		|	ДанныеСотрудников.СтатьяРасходов,
		|	ДанныеСотрудников.Подразделение,
		|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.НачальноеСальдо),
		|	NULL,
		|	ДанныеСотрудников.НачальныйОстаток,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.Организация,
		|	ДанныеСотрудников.Сотрудник,
		|	ДанныеСотрудников.ГоловнойСотрудник,
		|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,     
		|	ДанныеСотрудников.ВидДоговораГоловногоСотрудникаНаКонецПериода,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,              
		|	ДанныеСотрудников.ВидДоговораНаКонецПериода,
		|	ДанныеСотрудников.ДолжностьНаКонецПериода,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	ДанныеСотрудников.ВидЗанятости, 
		|	ДанныеСотрудников.ВидДоговора,
		|	ДанныеСотрудников.Должность,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	NULL,
		|	NULL,
		|	NULL,
		|   3
		|ИЗ
		|	ВТСальдоПоРасчетамССотрудниками КАК ДанныеСотрудников
		|ГДЕ
		|	ДанныеСотрудников.Организация ЕСТЬ НЕ NULL 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСотрудников.Период,
		|	ДанныеСотрудников.ФизическоеЛицо,
		|	ДанныеСотрудников.СтатьяФинансирования,
		|	ДанныеСотрудников.СтатьяРасходов,
		|	ДанныеСотрудников.Подразделение,
		|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.НачальноеСальдоПериода),
		|	NULL,
		|	ДанныеСотрудников.НачальныйОстаток,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.Организация,
		|	ДанныеСотрудников.Сотрудник,
		|	ДанныеСотрудников.ГоловнойСотрудник,
		|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода, 
		|	ДанныеСотрудников.ВидДоговораГоловногоСотрудникаНаКонецПериода,
		|	NULL,
		|	NULL,
		|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
		|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,   
		|	ДанныеСотрудников.ВидДоговораНаКонецПериода,
		|	ДанныеСотрудников.ДолжностьНаКонецПериода,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	ДанныеСотрудников.ВидЗанятости,
		|	ДанныеСотрудников.ВидДоговора,
		|	ДанныеСотрудников.Должность,
		|	ДанныеСотрудников.ТарифнаяСтавка,
		|	NULL,
		|	NULL,
		|	NULL,
		|   3
		|ИЗ
		|	ВТСальдоПоРасчетамССотрудниками КАК ДанныеСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПоследниеПервыеМесяцы КАК ПоследниеПервыеМесяцы
		|		ПО (ПоследниеПервыеМесяцы.Организация = ДанныеСотрудников.Организация)
		|			И (ПоследниеПервыеМесяцы.Сотрудник = ДанныеСотрудников.Сотрудник)
		|			И (ПоследниеПервыеМесяцы.ФизическоеЛицо = ДанныеСотрудников.ФизическоеЛицо)
		|			И (ПоследниеПервыеМесяцы.Подразделение = ДанныеСотрудников.Подразделение)
		|			И (ПоследниеПервыеМесяцы.СтатьяФинансирования = ДанныеСотрудников.СтатьяФинансирования)
		|			И (ПоследниеПервыеМесяцы.СтатьяРасходов = ДанныеСотрудников.СтатьяРасходов)
		|			И (ПоследниеПервыеМесяцы.ПервыйМесяц = ДанныеСотрудников.Период)
		|ГДЕ
		|	ДанныеСотрудников.Организация ЕСТЬ НЕ NULL ";
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров) Экспорт
	
	Запрос = Неопределено;
	
	ПозицияСловаПоместить = СтрНайти(ВРег(ТекстЗапроса), ВРег("ПОМЕСТИТЬ "));
	
	ИмяИсточникаДанных = ЗарплатаКадрыОбщиеНаборыДанных.ПервоеСловоНачинаяСПозицииВТексте(ТекстЗапроса, ПозицияСловаПоместить + СтрДлина("ПОМЕСТИТЬ "));
	МассивПодстрокИмениИсточникаДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяИсточникаДанных, "_");
	ИмяВременнойТаблицы = МассивПодстрокИмениИсточникаДанных[0];
	ИмяПредставления = МассивПодстрокИмениИсточникаДанных[1];
	Если МассивПодстрокИмениИсточникаДанных.Количество() > 2 Тогда
		ИмяПараметра = МассивПодстрокИмениИсточникаДанных[2];
	Иначе
		ИмяПараметра = Неопределено;
	КонецЕсли;
				
	МассивИменВТИсточниковПараметров = ЗарплатаКадрыОбщиеНаборыДанных.МассивИменВТИсточниковПараметров(ТекстЗапроса, ИмяИсточникаДанных);
	ПараметрыЗапроса = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыЗапроса(ТекстЗапроса, ИмяИсточникаДанных);
				
	ПредставлениеТолькоРазрешенные = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ТолькоРазрешенные", ПараметрыЗапроса);
	ТолькоРазрешенные = ВРег(ПредставлениеТолькоРазрешенные) = ВРег("Истина");
	
	Если ВРег(ИмяПредставления) = Врег("Периоды") Тогда
		
		НачалоИнтервала = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("НачалоИнтервала", ПараметрыЗапроса);
        ОкончаниеИнтервала = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ОкончаниеИнтервала", ПараметрыЗапроса);
		
		Периодичность = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Периодичность", ПараметрыЗапроса);
		Если Периодичность = Неопределено Тогда
			Периодичность = ВРег("Месяц");
		КонецЕсли;
		
		ИмяПоляПериод = "Период";
		
		ПредставлениеИспользоватьКонецПериода = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ИспользоватьКонецПериода", ПараметрыЗапроса);
		Если Периодичность = Неопределено Тогда
			ИспользоватьКонецПериода = Ложь;
		Иначе
			ИспользоватьКонецПериода = ВРег(ПредставлениеИспользоватьКонецПериода) = ВРег("Истина");
		КонецЕсли;
		
		Запрос = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТПериоды(
			НачалоИнтервала,
			ОкончаниеИнтервала,
			Периодичность,
			ИмяПоляПериод,
			ИмяИсточникаДанных,
			ИспользоватьКонецПериода);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ТаблицаРегистра")
		ИЛИ ВРег(ИмяПредставления) = ВРег("СрезПоследних")
		ИЛИ ВРег(ИмяПредставления) = ВРег("СрезПервых") Тогда
		
		ИмяРегистра = ИмяПараметра;
		ИмяСоздаваемойТаблицы = ИмяИсточникаДанных;
		
		ИмяВТФильтра = МассивИменВТИсточниковПараметров[0];
		ИзмеренияФильтра = ЗарплатаКадрыОбщиеНаборыДанных.МассивПолейЗапроса(СоответствиеПараметров[ИмяВТФильтра]);
		
		ОписаниеФильтра = ЗарплатаКадрыОбщиеНаборыДанных.ОписаниеФильтраДляСоздатьВТИмяРегистра(ИмяВТФильтра, ИзмеренияФильтра);

		Если ВРег(ИмяПредставления) = ВРег("ТаблицаРегистра") Тогда
			ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистра();
		Иначе
			ПараметрыПостроения = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		КонецЕсли;
			
		ПараметрыПостроения.Отборы = ЗарплатаКадрыОбщиеНаборыДанных.КоллекцияОтборПоПараметрам(ПараметрыЗапроса);
		
		Если ВРег(ИмяПредставления) = ВРег("ТаблицаРегистра") Тогда
			Запрос = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистра(ИмяРегистра, ТолькоРазрешенные, ОписаниеФильтра, ПараметрыПостроения, ИмяСоздаваемойТаблицы);
		ИначеЕсли ВРег(ИмяПредставления) = ВРег("СрезПоследних") Тогда
			Запрос = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(ИмяРегистра, ТолькоРазрешенные, ОписаниеФильтра, ПараметрыПостроения, Истина, ИмяСоздаваемойТаблицы);
		Иначе
			Запрос = ЗарплатаКадрыОбщиеНаборыДанных.ЗапросВТИмяРегистраСрез(ИмяРегистра, ТолькоРазрешенные, ОписаниеФильтра, ПараметрыПостроения, Ложь, ИмяСоздаваемойТаблицы);
		КонецЕсли;
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("КадровыеДанныеФизическихЛиц") Тогда
		
		Отбор = ЗарплатаКадрыОбщиеНаборыДанных.КоллекцияОтборПоПараметрам(ПараметрыЗапроса);
		
		КоллекцияПолей =  ЗарплатаКадрыОбщиеНаборыДанных.МассивПолейЗапроса(Лев(ТекстЗапроса, ПозицияСловаПоместить - 1));
		
		ПоляОтбораФизическихЛиц = КадровыйУчет.ПоляОтбораФизическихЛиц();
		
		ОписательТаблицыОтборов = КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц(
			МассивИменВТИсточниковПараметров[0],
			ПоляОтбораФизическихЛиц.ФизическоеЛицо,
			ПоляОтбораФизическихЛиц.Период);
		
		Запрос = КадровыйУчет.ЗапросВТКадровыеДанныеФизическихЛиц(
			ТолькоРазрешенные,
			ОписательТаблицыОтборов,
			КоллекцияПолей,
			Отбор,
			,
			ИмяИсточникаДанных);	
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("КадровыеДанныеСотрудников") Тогда
		
		Отбор = ЗарплатаКадрыОбщиеНаборыДанных.КоллекцияОтборПоПараметрам(ПараметрыЗапроса);
		
		КоллекцияПолей =  ЗарплатаКадрыОбщиеНаборыДанных.МассивПолейЗапроса(Лев(ТекстЗапроса, ПозицияСловаПоместить - 1));
		
		ПоляОтбораСотрудников = КадровыйУчет.ПоляОтбораСотрудников();
		
		ОписательТаблицыОтборов = КадровыйУчет.ОписаниеВременнойТаблицыОтборовСотрудников(
			МассивИменВТИсточниковПараметров[0],
			ПоляОтбораСотрудников.Сотрудник,
			ПоляОтбораСотрудников.Период);
		
		Запрос = КадровыйУчет.ЗапросВТКадровыеДанныеСотрудников(
			ТолькоРазрешенные,
			ОписательТаблицыОтборов,
			КоллекцияПолей,
			Отбор,
			,
			,
			ИмяИсточникаДанных);	
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("РабочиеМестаСотрудников") Тогда
		
		Организация = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Организация", ПараметрыЗапроса);
		Подразделение = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Подразделение", ПараметрыЗапроса);
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];

		Параметры = КадровыйУчет.ПараметрыДляЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице();
		
		Параметры.Организация = Организация;
		Параметры.Подразделение = Подразделение;
		Параметры.ИмяВТСотрудникиПериоды = ИмяВТИсточникДанных;
		
		Запрос = КадровыйУчет.ЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице(
			ТолькоРазрешенные,
			ИмяИсточникаДанных,
			Параметры);
			
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("СотрудникиОрганизации") Тогда
			
		Организация = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Организация", ПараметрыЗапроса);
		Подразделение = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Подразделение", ПараметрыЗапроса);
		
		Если МассивИменВТИсточниковПараметров.Количество() > 0 Тогда
			Параметры = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
			Параметры.ИмяВТФизическиеЛица = МассивИменВТИсточниковПараметров[0];
		Иначе
			Параметры = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		КонецЕсли;
		
		ПредставлениеОтбиратьПоГоловнойОрганизации = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ОтбиратьПоГоловнойОрганизации", ПараметрыЗапроса);
		Параметры.ОтбиратьПоГоловнойОрганизации = ВРег(ПредставлениеОтбиратьПоГоловнойОрганизации) = ВРег("Истина");
	
		Параметры.Организация = Организация;
		Параметры.Подразделение = Подразделение;
		Параметры.НачалоПериода = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("НачалоПериода", ПараметрыЗапроса);
		Параметры.ОкончаниеПериода = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ОкончаниеПериода", ПараметрыЗапроса);
		
		Параметры.КадровыеДанные =  ЗарплатаКадрыОбщиеНаборыДанных.МассивПолейЗапроса(Лев(ТекстЗапроса, ПозицияСловаПоместить - 1));
		
		Запрос = КадровыйУчет.ЗапросВТСотрудникиОрганизации(
			ТолькоРазрешенные,
			ИмяИсточникаДанных,
			Параметры);
			
	КонецЕсли;
		
	Возврат Запрос;	
	
КонецФункции

#КонецОбласти
